; domain
(define (domain delivery)
  (:requirements :strips :typing)
  (:types
    agent package location
  )
  (:predicates
    (at ?a - agent ?l - location)
    (has ?a - agent ?p - package)
    (in ?p - package ?l - location)
    (connected ?from ?to - location)
    (requested ?p - package ?dest - location)
    (delivered ?p - package)
    (available ?a - agent)
  )

  (:action pick-up
    :parameters (?a - agent ?p - package ?l - location)
    :precondition (and (at ?a ?l) (in ?p ?l) (available ?a))
    :effect (and (not (in ?p ?l)) (has ?a ?p))
  )

  (:action move
    :parameters (?a - agent ?from ?to - location)
    :precondition (and (at ?a ?from) (connected ?from ?to) (available ?a))
    :effect (and (not (at ?a ?from)) (at ?a ?to))
  )

  (:action drop-off
    :parameters (?a - agent ?p - package ?l - location)
    :precondition (and (has ?a ?p) (at ?a ?l) (requested ?p ?l))
    :effect (and (not (has ?a ?p)) (delivered ?p))
  )
)

; problem
(define (problem delivery-multi-priority)
(:domain delivery)
(:objects
  robot2 - agent
  pkgA pkgB - package
  loc1 loc2 loc3 - location
)
(:init
  (at robot2 loc1)
  (in pkgA loc1)(in pkgB loc1) ; 改为都在loc1
  (connected loc1 loc2)(connected loc2 loc3)
  (requested pkgA loc3)(requested pkgB loc1)
  (available robot2)
)
(:goal (and (delivered pkgA)(delivered pkgB))))

; plan
1. (pick-up robot2 pkgb loc1)
   deleted: (in pkgb loc1)
   added: (has robot2 pkgb)
   goals met: 0 of 2
2. (drop-off robot2 pkgb loc1)
   deleted: (has robot2 pkgb)
   added: (delivered pkgb)
   goals met: 1 of 2
3. (pick-up robot2 pkga loc1)
   deleted: (in pkga loc1)
   added: (has robot2 pkga)
   goals met: 1 of 2
4. (move robot2 loc1 loc2)
   deleted: (at robot2 loc1)
   added: (at robot2 loc2)
   goals met: 1 of 2
5. (move robot2 loc2 loc3)
   deleted: (at robot2 loc2)
   added: (at robot2 loc3)
   goals met: 1 of 2
6. (drop-off robot2 pkga loc3)
   deleted: (has robot2 pkga)
   added: (delivered pkga)
   goals met: 2 of 2
